fed-ex/Rate  Express Freight.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://fedex.com/ws/rate/v14">
<SOAP-ENV:Body>
<ns1:RateRequest>
<ns1:WebAuthenticationDetail>
<ns1:UserCredential>
<ns1:Key>“Input Your Information”</ns1:Key>
<ns1:Password>“Input Your Information”</ns1:Password>
</ns1:UserCredential>
</ns1:WebAuthenticationDetail>
<ns1:ClientDetail>
<ns1:AccountNumber>“Input Your Information”</ns1:AccountNumber>
<ns1:MeterNumber>“Input Your Information”</ns1:MeterNumber>
</ns1:ClientDetail>
<ns1:TransactionDetail>
<ns1:CustomerTransactionId> *** Rate Request v14.***</ns1:CustomerTransactionId>
</ns1:TransactionDetail>
<ns1:Version>
<ns1:ServiceId>crs</ns1:ServiceId>
<ns1:Major>14</ns1:Major>
<ns1:Intermediate>0</ns1:Intermediate>
<ns1:Minor>0</ns1:Minor>
</ns1:Version>
<ns1:ReturnTransitAndCommit>true</ns1:ReturnTransitAndCommit>
<ns1:RequestedShipment>
<ns1:ShipTimestamp>2013-07-16T06:05:19+00:00</ns1:ShipTimestamp>
<ns1:DropoffType>REGULAR_PICKUP</ns1:DropoffType>
<ns1:ServiceType>FEDEX_FREIGHT_ECONOMY</ns1:ServiceType>
<ns1:PackagingType>YOUR_PACKAGING</ns1:PackagingType>
<ns1:Shipper>
<ns1:Contact>
<ns1:ContactId>freight1</ns1:ContactId>
<ns1:PersonName>Big Shipper</ns1:PersonName>
<ns1:Title>Manager</ns1:Title>
<ns1:CompanyName>Freight Shipper Co</ns1:CompanyName>
<ns1:PhoneNumber>1234567890</ns1:PhoneNumber>
</ns1:Contact>
<ns1:Address>
<ns1:StreetLines>6695 TAYLOR RD</ns1:StreetLines>
<ns1:StreetLines>Do Not Delete - Test Account</ns1:StreetLines>
<ns1:City>BLACKLICK</ns1:City>
<ns1:StateOrProvinceCode>OH</ns1:StateOrProvinceCode>
<ns1:PostalCode>43004</ns1:PostalCode>
<ns1:CountryCode>US</ns1:CountryCode>
</ns1:Address>
</ns1:Shipper>
<ns1:Recipient>
<ns1:Contact>
<ns1:PersonName>Sender Name</ns1:PersonName>
<ns1:CompanyName>Sender Company Name</ns1:CompanyName>
<ns1:PhoneNumber>1234567890</ns1:PhoneNumber>
</ns1:Contact>
<ns1:Address>
<ns1:StreetLines>Address Line 1</ns1:StreetLines>
<ns1:City>Austin</ns1:City>
<ns1:StateOrProvinceCode>TX</ns1:StateOrProvinceCode>
<ns1:PostalCode>73301</ns1:PostalCode>
<ns1:CountryCode>US</ns1:CountryCode>
</ns1:Address>
</ns1:Recipient>
<ns1:ShippingChargesPayment>
<ns1:PaymentType>SENDER</ns1:PaymentType>
<ns1:Payor>
<ns1:ResponsibleParty>
<ns1:AccountNumber>“Input Your Information”</ns1:AccountNumber>
</ns1:ResponsibleParty>
</ns1:Payor>
</ns1:ShippingChargesPayment>
<ns1:FreightShipmentDetail>
<ns1:FedExFreightAccountNumber>“Input Your Information”</ns1:FedExFreightAccountNumber>
<ns1:FedExFreightBillingContactAndAddress>
<ns1:Contact>
<ns1:ContactId>freight1</ns1:ContactId>
<ns1:PersonName>Big Shipper</ns1:PersonName>
<ns1:Title>Manager</ns1:Title>
<ns1:CompanyName>Freight Shipper Co</ns1:CompanyName>
<ns1:PhoneNumber>1234567890</ns1:PhoneNumber>
</ns1:Contact>
<ns1:Address>
<ns1:StreetLines>6695 TAYLOR RD</ns1:StreetLines>
<ns1:StreetLines>Do Not Delete - Test Account</ns1:StreetLines>
<ns1:City>BLACKLICK</ns1:City>
<ns1:StateOrProvinceCode>OH</ns1:StateOrProvinceCode>
<ns1:PostalCode>43004</ns1:PostalCode>
<ns1:CountryCode>US</ns1:CountryCode>
</ns1:Address>
</ns1:FedExFreightBillingContactAndAddress>
<ns1:Role>SHIPPER</ns1:Role>
<ns1:CollectTermsType>STANDARD</ns1:CollectTermsType>
<ns1:DeclaredValuePerUnit>
<ns1:Currency>USD</ns1:Currency>
<ns1:Amount>50</ns1:Amount>
</ns1:DeclaredValuePerUnit>
<ns1:LiabilityCoverageDetail>
<ns1:CoverageType>NEW</ns1:CoverageType>
<ns1:CoverageAmount>
<ns1:Currency>USD</ns1:Currency>
<ns1:Amount>50</ns1:Amount>
</ns1:CoverageAmount>
</ns1:LiabilityCoverageDetail>
<ns1:TotalHandlingUnits>15</ns1:TotalHandlingUnits>
<ns1:ClientDiscountPercent>0</ns1:ClientDiscountPercent>
<ns1:PalletWeight>
<ns1:Units>LB</ns1:Units>
<ns1:Value>20</ns1:Value>
</ns1:PalletWeight>
<ns1:ShipmentDimensions>
<ns1:Length>90</ns1:Length>
<ns1:Width>30</ns1:Width>
<ns1:Height>50</ns1:Height>
<ns1:Units>IN</ns1:Units>
</ns1:ShipmentDimensions>
<ns1:LineItems>
<ns1:FreightClass>CLASS_050</ns1:FreightClass>
<ns1:Packaging>PALLET</ns1:Packaging>
<ns1:Description>Heavy Stuff</ns1:Description>
<ns1:Weight>
<ns1:Units>LB</ns1:Units>
<ns1:Value>50</ns1:Value>
</ns1:Weight>
<ns1:Dimensions>
<ns1:Length>90</ns1:Length>
<ns1:Width>30</ns1:Width>
<ns1:Height>50</ns1:Height>
<ns1:Units>IN</ns1:Units>
</ns1:Dimensions>
<ns1:Volume>
<ns1:Units>CUBIC_FT</ns1:Units>
<ns1:Value>30</ns1:Value>
</ns1:Volume>
</ns1:LineItems>
</ns1:FreightShipmentDetail>
<ns1:RateRequestTypes>LIST</ns1:RateRequestTypes>
<ns1:PackageCount>1</ns1:PackageCount>
</ns1:RequestedShipment>
</ns1:RateRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>